export const personalityTypes: { [key: string]: string } = {
    'LPBT': '승률 중심 롱 포지션 돌파 트레이더 (돌파 매매 선호)',
    'LPBF': '승률 중심 롱 포지션 리테스트 트레이더 (되돌림 매매 선호)',
    'LPRT': '승률 중심 롱 포지션 추세 트레이더 (추세 매매 선호)',
    'LPRC': '승률 중심 롱 포지션 역추세 트레이더 (역추세 매매 선호)',
    'LRBT': '손익비 중심 롱 포지션 돌파 트레이더 (돌파 매매로 큰 수익 목표)',
    'LRBF': '손익비 중심 롱 포지션 리테스트 트레이더 (되돌림 매매로 큰 수익 목표)',
    'LRRT': '손익비 중심 롱 포지션 추세 트레이더 (추세를 따라 장기 투자)',
    'LRRC': '손익비 중심 롱 포지션 역추세 트레이더 (급락 후 반등 시 매수)',
    'SPBT': '승률 중심 숏 포지션 돌파 트레이더 (급락 돌파 시 숏 진입)',
    'SPBF': '승률 중심 숏 포지션 리테스트 트레이더 (되돌림 시 숏 진입)',
    'SPRT': '승률 중심 숏 포지션 추세 트레이더 (하락 추세에서 지속 숏)',
    'SPRC': '승률 중심 숏 포지션 역추세 트레이더 (반등 후 하락 전환 시 숏)',
    'SRBT': '손익비 중심 숏 포지션 돌파 트레이더 (큰 손익비로 급락 노림)',
    'SRBF': '손익비 중심 숏 포지션 리테스트 트레이더 (되돌림 후 숏 진입)',
    'SRRT': '손익비 중심 숏 포지션 추세 트레이더 (장기 하락장에서 숏 유지)',
    'SRRC': '손익비 중심 숏 포지션 역추세 트레이더 (반등 후 추가 하락 기대)'
};
